#include <iostream>
#include<Windows.h>
using namespace std;

/*
\n перехід на нову строку
\t + одна табуляція [TAB]
\b видалення попереднього виведеного елемента
\ тa символ який потрібно вивести, щоб не було конфліктів 
*/


int main() {	
	SetConsoleOutputCP(65001);
	SetConsoleCP(65001);
	cout << "\tМожливо, зн\bову загримлять гармати,\n";
	cout << "\tІ танк зімне пшеницю на лану,\n";
	cout << "\tІ буде плакать і журитись мати,\n";
	cout << "\tКоли сини ітимуть на війну.\n";
	cout << "\tРр\bар\bк";
}