#include <iostream>
#include<iomanip>
using namespace std;
int main()
{
	int n,s = 0;
	cin >> n;//прочитали кількість елементів масиву
	int a[n]; // описали масив
	for(int i = 0; i < n; i++)
	{
		cin >> a[i]; //взяли елемент з потоку та
		s = s + a[i];// додали його до поточної суми
	}
	int s1 = 0;// початкове значення суми відібраних елементів
	int k=0;//початкове значення кількості таких елементів
	for(int i = 0; i < n; i++)
	{
		if(n*a[i]>s)// якщо елемент більший за середнє, то
		{
		k++; // збільшуємо лічильник, та
		s1=s1+a[i];// додаємо його до поточної суми
		}
	}
	cout<<s1<<' '<<k; // виводимо два числа через пропуск
}
